// 제너릭(Generic) 클래스
// - 클래스에서 결정되지 않은 타입을 매개변수로 처리하고 실제 생성시
//   매개변수에 해당하는 부분을 구체적인 타입으로 대체하는 클래스
// - 클래스를 정의하는 시점에 타입을 정의하는 것이 아니라
//   객체를 생성하는 시점에 타입을 지정하는 클래스
// 제너릭 매개변수명 관례
// - T(타입), K(키이), V(값), N(숫자), E(원소)
// 제너릭 인터페이스
// - List<E>, Set<E>, Map<K,V>
// 제너릭 메소드
// - 일반 클래스에서 제너릭으로 선언된 메소드

package ch07_Generic클래스;

public class 실습 {

	public static void main(String[] args) {
		// 구체 클래스 객체 생성

		
		
		// 제너릭 매개변수 1개를 갖는 제너릭 클래스 객체 생성	
		// - Integer 제너릭 매개변수를 갖는 제너릭 클래스 객체 생성
		
		
		// - String 제너릭 매개변수를 갖는 제어릭 클래스 객체 생성

		
		// - 사용자 클래스 제너릭 매개변수를 갖는 제어릭 클래스 객체 생성
		
		
		// - Object 제너릭 매개변수를 갖는 제어릭 클래스 객체 생성
		
		
		// 제너릭 매개변수 2개를 갖는 제너릭 클래스 객체 생성		
		// - Integer, String 제너릭 매개변수를 갖는 제너릭 클래스 객체 생성
		
		
		// - Object, Object 제너릭 매개변수를 갖는 제너릭 클래스 객체 생성
		
		
		
	}
}
