// 컬렉션(Collection) vs. 배열(array)
// - 컬렉션: 동일 타입의 원소들을 묶어 동적으로 관리하는 자료구조
// - 배열: 동일 타입의 원소들을 묶어 정적으로 관리하는 자료구조
// - 배열은 생성 시점에 크기 정해지고 변경 불가
// - 컬렉션에서 원소는 객체만 가능 -> Collection<int> 불가
// - 컬렉션의 자료구조 특성에 따라 List, Set, Map으로 구분
//   - List
//     - 순서유지(연속적/순차적 저장), 중복저장 가능
//   - Set
//     - 순서없음(인덱스 정보 없음), 중복저장 불가
//   - Map
//     - 키와 값(데이터) 쌍으로 구성된 엔트리 객체 저장 -> Map.Entry 타입으로 정의됨
//     - 순서없음, 키 중복 불가, 값 중복 가능

package ch08_Collection프레임워크.배열과컬렉션차이;

import java.util.*;

public class 실습 {

	public static void main(String[] args) {
		// 배열
		// - 문자열 배열 생성과 이용 보기

		
		// - Student 객체 배열 생성과 이용 보기
		
		
		// 컬렉션
		// - 문자열 컬렉션 생성과 이용 보기

		
		// - 정수형 컬렉션 생성과 이용 보기
		
		
		// - Student 컬렉션 생성과 이용 보기
		
		
	}
}
